#+title: Playing with AlephJS
#+subtitle: fun in deno land
#+tags[]: deno, alephjs
#+draft: true
#+date: 2021-03-13

* Installing alephjs

First we need to make sure that deno is installed:

#+begin_src bash :results output
deno --version
#+end_src

#+RESULTS:
: deno 1.8.3 (release, x86_64-unknown-linux-gnu)
: v8 9.0.257.3
: typescript 4.2.2

Then install the aleph cli.  Check for the latest version in [[https://alephjs.org/docs/get-started][the aleph]]
installation documentation.

#+begin_src bash :results output
deno install --unstable -A -f -n aleph https://deno.land/x/aleph@v0.3.0-alpha.33/cli.ts
#+end_src

#+RESULTS:
: ✅ Successfully installed aleph
: /home/wschenk/.asdf/installs/deno/1.6.3/.deno/bin/aleph

Now we can create our project:

#+begin_src bash
aleph init hello
#+end_src

Which will install a bunch of stuff into the =hello= directory.

* In a docker container

#+begin_src Dockerfile :tangle Dockerfile
FROM denoland/deno:1.12.0

WORKDIR /app

#USER deno

RUN deno install --unstable -A -f -n aleph https://deno.land/x/aleph@v0.3.0-alpha.33/cli.ts

#RUN aleph init hello

#WORKDIR /app/hello

CMD bash
#+end_src

#+begin_src bash :results output
docker build . -t wschenk/aleph
#+end_src

Then run it

#+begin_src bash
  mkdir -p hello
  docker run --rm -it -v $PWD/hello:/app/hello -p 8080:8080 wschenk/aleph
#+end_src

Inside of the container:

#+begin_src bash
  aleph init hello
  cd hello
  aleph dev 
#+end_src

And visit http://localhost:8080 to see the Alephjs landing page.

* References

1. https://alephjs.org/docs/get-started
2.    
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)
# End:
